#あえぎ声の生成チャート
#Google Colaboratoryで使用

#描写関係
!apt install fonts-ipafont
from graphviz import Digraph
from IPython.display import Image, display
!mkdir images

#データ
data_list_aegi = [["^","ん"],["ん","ん"],["ん","ぅ"],["ん","…"],["ん","っ"],["^","ぅ"],["ぅ","…"],["ぅ","っ"],["^","ぁ"],["ぁ","ぁ"],["ぁ","…"],["ぁ","っ"],["^","ふ"],["ふ","ぁ"],["^","は"]
                  ,["は","っ"],["は","ぁ"],["は","あ"],["^","あ"],["あ","あ"],["あ","ぁ"],["あ","っ"],["あ","…"],["あ","ひ"],["^","ひ"],["ひ","っ"],["^","う"],["う","っ"],["^","く"]
                  ,["く","っ"],["…","っ"],["…","…"],["…","♪"],["…","!"],["…","$"],["っ","…"],["っ","!"],["っ","$"],["♪","$"],["!","!"],["!","?"],["!","$"],["?","$"]
                  ,["ひ","ゃ"],["ゃ","っ"],["う","ぅ"],["っ","♡"],["…","♡"],["♡","$"]]

data_list_huera = [["^","れ"],["れ","ろ"],["ろ","っ"],["^","じ"],["じ","ゅ"],["ゅ","っ"],["ゅ","う"],["ゅ","る"],["^","ち"],["ち","ゅ"],["う","っ"],["る","る"],["る","っ"]
                   ,["^","ん"],["ん","ん"],["ん","ち"],["ん","っ"],["ん","…"],["^","は"],["は","ぁ"],["^","ふ"],["ふ","っ"],["ふ","ぁ"],["ぁ","っ"],["ぁ","…"],["っ","…"]
                   ,["…","っ"],["っ","!"],["!","$"],["っ","$"],["っ","♪"],["…","…"],["…","!"],["…","$"],["…","♪"],["♪","$"]
                   ,["^","ぺ"],["ぺ","ろ"],["ろ","…"],["ゅ","ぼ"],["ぼ","っ"],["ゅ","ぅ"],["ぅ","ぅ"],["ぅ","っ"],["ぅ","…"],["ふ","…"],["ん","ぐ"]
                   ,["ぐ","っ"],["ん","ふ"],["^","あ"],["あ","っ"],["あ","ふ"],["^","ぁ"],["ぁ","ふ"],["^","も"],["も","ご"],["ご","っ"],["ご","…"],["う","ぅ"],["は","む"],["む","っ"]
                   ,["^","ぢ"],["ぢ","ゅ"],["ふ","ぅ"]]

data_lists = [data_list_aegi,data_list_huera]

title_list = ["あえぎ声・破瓜","フェラ・キス・舐める"]

for i in [0,1]:
  # 計算グラフの構造を定義
  title = title_list[i] + "の生成チャート"
  dot = Digraph(f'G_test', directory='./images',format='png', graph_attr={'rankdir': 'LR'})
  dot.attr(label=title,labeljust="c",labelloc="b",splines="spline",fontsize="25",dpi="1200")

  data_list = data_lists[i]
  # ノードの追加
  for m in data_list:
    dot.node('node'+ m[0], m[0])
    dot.node('node'+ m[1], m[1])

  # エッジの追加
  for n in data_list:
    dot.edge('node'+ n[0], 'node'+ n[1])

  # 計算グラフを画像として出力
  display(Image(dot.render()))